Revit 2026 API

# PartMakerSetSourceElementIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSourceElementIds(
	ICollection<ElementId> sourceElementIds
)
```
```vb
Public Sub SetSourceElementIds (
	sourceElementIds As ICollection(Of ElementId)
)
```
```cpp
public:
void SetSourceElementIds(
	ICollection<ElementId^>^ sourceElementIds
)
```
```fsharp
member SetSourceElementIds :
        sourceElementIds : ICollection<ElementId> -> unit
```

#### Parameters

sourceElementIds ICollectionElementId

#### Reference

PartMaker Class

Autodesk.Revit.DB Namespace